src/DataProcessors/ЗагрузкаДанныхИзТабличногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхИзТабличногоДокумента</Name>
			<Comment>Загрузка данных из табличного документа</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗагружаемыхРеквизитов</Name>
					<Comment>Таблица загружаемых реквизитов</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьНовыхЭлементов</Name>
					<Comment>Флаг Не создавать новых элементов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНумерацияКолонокТабличногоДокумента</Name>
					<Comment>Ручная нумерация колонок табличного документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрокаДанныхТабличногоДокумента</Name>
					<Comment>Первая строка данных табличного документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗагрузки</Name>
					<Comment>Режим загрузки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаИсточника</Name>
					<Comment>Ссылка источника</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьИсточника</Name>
					<Comment>Табличная часть источника</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьДокументаОбъекта</Name>
					<Comment>Табличная часть документа объекта</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередЗаписьюОбъекта</Name>
					<Comment>Перед записью объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриЗаписиОбъекта</Name>
					<Comment>При записи объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослеДобавленияСтроки</Name>
					<Comment>После добавления строки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВидаРегистра</Name>
					<Comment>Имя вида регистра</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещатьСуществующиеЗаписи</Name>
					<Comment>Замещать существующие записи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьОбъекта</Name>
					<Comment>Табличная часть объекта</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флПоискПоПрайсуПоставщика</Name>
					<Comment>Поиск по прайсу поставщика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхиваЗагруженныхФайлов</Name>
					<Comment>Каталог архива загруженных файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеСЗагружаемымФайлом</Name>
					<Comment>Действие с загружаемым файлом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Comment>Имя справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьСуществующиеЭлементы</Name>
					<Comment>Флаг Не обновлять существующие элементы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Табуляция</Name>
					<Comment>Разделитель между колонками для текстовых документов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаФормироватьНовыеСерии</Name>
					<Comment>Всегда формировать новые серии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаДополнительныхПараметров</Name>
					<Comment>Таблица дополнительных параметров</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматДатыСрокаГодности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПроизводителя</Name>
					<Comment>Создавать производителя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВнешнийМодульПреобразованияФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаПреобразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧДокумента</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбъект</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДополнительныеРеквизитыИСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеРеквизитыИСведенияТолькоОбщие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеРеквизитыПоТипуНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенийБольшеОдного</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ЗагрузкаДанныхИзТабличногоДокумента/Forms/ФормаДобавленияНоменклатуры/Ext/Form/Module.bsl
// Процедура создания номенклатуры
//
&НаСервере
Процедура СоздатьНоменклатуру()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЕдиницаИзмерения",    ЕдиницаИзмерения);
	ДанныеЗаполнения.Вставить("СтавкаНДС",           СтавкаНДС);
	ДанныеЗаполнения.Вставить("СтранаПроисхождения", СтранаПроисхождения);
	ДанныеЗаполнения.Вставить("ВалютаУчета",         ВалютаУчета);
	//laza (Также сделал невидимым элемент формы Артикул)ДанныеЗаполнения.Вставить("Артикул",              Артикул);
	ЗагрузкаИзЭлектронныхДокументовВызовСервера.СоздатьНоменклатуру(Объект.СоответствиеНоменклатуры.Выгрузить(), 
																ГруппаНоменклатуры, 
																ТипНоменклатуры, 
																ДанныеЗаполнения);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.СоответствиеНоменклатуры=Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект.СоответствиеНоменклатуры.Загрузить(Параметры.СоответствиеНоменклатуры.Выгрузить());
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Процедура - обработчик команды "Добавить".
//
&НаКлиенте
Процедура Добавить(Команда)
	
	ЗаполненыОбязательныеРеквизиты = Истина;
	
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		ЗаполненыОбязательныеРеквизиты = Ложь;
		ВывестиСообщение(НСтр("ru= 'Реквизит <Тип номенклатуры> не заполнен.'"));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		// Если ставки ндс заполнены в таблица соответствия номенклатуры для тех позиций, которые собираемся загружать,
		//  то реквизит формы СтавкаНДС может оставаться не заполненным.
		СтавкаНДСОбязательна = Объект.СоответствиеНоменклатуры.НайтиСтроки(Новый Структура("Загружать, СтавкаНДС", Истина, ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка"))).Количество()>0;
		Если СтавкаНДСОбязательна Тогда
			ЗаполненыОбязательныеРеквизиты = Ложь;
			ВывестиСообщение(НСтр("ru= 'Реквизит <Ставка НДС> не заполнен.'"));
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЗаполненыОбязательныеРеквизиты=Ложь;
		ВывестиСообщение(НСтр("ru= 'Реквизит <Единица измерения> не заполнен.'"));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаУчета) Тогда
		ЗаполненыОбязательныеРеквизиты=Ложь;
		ВывестиСообщение(НСтр("ru= 'Реквизит <Валюта учета> не заполнен.'"));
	КонецЕсли;
	
	//laza Если НЕ ЗначениеЗаполнено(Артикул) Тогда
	//	ЗаполненыОбязательныеРеквизиты=Ложь;
	//	ВывестиСообщение(НСтр("ru= 'Реквизит <№ по каталогу> не заполнен.'"));
	//КонецЕсли;


	Если НЕ ЗаполненыОбязательныеРеквизиты Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьНоменклатуру();
	
	Закрыть(Истина);
	
КонецПроцедуры
